---
kind: property
id: P:Autodesk.Revit.DB.Visual.Water.WaterTintColor
source: html/6c4f496f-6007-40be-2f67-558ad22d79d9.htm
---
# Autodesk.Revit.DB.Visual.Water.WaterTintColor Property

The property labeled "Custom Color" from the "Water" schema.

## Syntax (C#)
```csharp
public static string WaterTintColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.